<h2 style="color:green" align="center">Pandas</h2>

## `What is Pandas ?`

`Pandas is fast , powerfull,flexible and easy to use open source data analysis and manipualation tool,buit on top of the Python Programming Language.`

In [359]:
import pandas as pd
import numpy as np

In [360]:
pd.__version__

'1.2.4'

In [361]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [362]:
type(population_dict)

dict

*******************************************************************************************************************************

## `Series`
  * 1D ndarray with an axis label

In [363]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [364]:
population.shape # Series

(5,)

In [365]:
type(population)

pandas.core.series.Series

In [366]:
population['California']

38956785

In [367]:
population[0]

38956785

In [368]:
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [370]:
population['California':'Illinois']

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

`Creat the varible which store the data frame`

In [371]:
df = pd.DataFrame(population)
df

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

## `Shape`

In [372]:
df.shape # DataFrame

(5, 1)

In [373]:
#Change column Name
df = pd.DataFrame(population, columns=['Population'])
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [374]:
pd.DataFrame(np.random.rand(3,2), columns=['Bingoo','Madangle'], index=['a','b','c'])

     Bingoo  Madangle
a  0.961390  0.161693
b  0.052661  0.689790
c  0.368343  0.971498

**********************************************************************************************************************

## `Index`

In [375]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

`Change the index`

In [376]:
pd.Series( [2,4,6] , index=[100,200,300] )

100    2
200    4
300    6
dtype: int64

In [377]:
pd.Series( [2,4,6] , index=['a','b','c'] )

a    2
b    4
c    6
dtype: int64

In [378]:
pd.Series( {2:'a' ,  4:'b', 6:'c'}, index=[3,2] )

3    NaN
2      a
dtype: object

In [379]:
pd.Series( 5 )

0    5
dtype: int64

In [380]:
pd.Series( 5 , index=[100,200,300] )

100    5
200    5
300    5
dtype: int64

****************************************************************************************************************************

## `Indexing : loc and iloc`

In [381]:
data = pd.Series(['a','b','c'] , index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [382]:
data

1    a
3    b
5    c
dtype: object

In [383]:
# explicit index when indexing
data[1]

'a'

In [384]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

`* LOC - It check  real Index`

`* ILOC - It goes for sequence like 0,1,2,3`

In [385]:
data.loc[1]

'a'

In [386]:
data.iloc[1:3] # SI to (EI-1)

3    b
5    c
dtype: object

In [387]:
data.loc[1:3]

1    a
3    b
dtype: object

In [388]:
data.iloc[1]

'b'

****************************************************************************************************************************

## `Contact and Merge`

In [389]:
df1 = pd.DataFrame(
    {
    "A":["A0","A1","A2","A3"],
    "B":["B0","B1","B2","B3"],
    "C":["C0","C1","C2","C3"],
    "D":["D0","D1","D2","D3"]
    },index= [0,1,2,3])

In [390]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [391]:
df2 = pd.DataFrame(
    {
    "A":["A4","A5","A6","A7"],
    "B":["B4","A5","B6","B7"],
    "C":["C4","C5","C6","C7"],
    "D":["D4","D5","D6","D7"]
    },index=[4,5,6,7])

In [392]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  A5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [393]:
df3 = pd.DataFrame(
    {
    "A":["A8","A9","A10","A11"],
    "B":["B8","B9","B10","B11"],
    "C":["C8","C9","C10","C11"],
    "D":["D8","D9","D10","D11"]
    },index= [8,9,10,11])

In [394]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [395]:
frames = [df1,df2,df3]
frames

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  A5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [396]:
result = pd.concat(frames)
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   A5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [397]:
result1 = pd.concat(frames,axis= 1)

In [398]:
result1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   A5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [399]:
result1.fillna(value="0")

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  A5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

In [400]:
df1.loc[1:3]

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [401]:
df4 =pd.DataFrame(
{
    "E":["E0","E1","E2","E4"],
    "F":["F0","F1","F2","F3"],
    "G":["G0","G1","G2","G3"]
   
})

In [402]:
df4

    E   F   G
0  E0  F0  G0
1  E1  F1  G1
2  E2  F2  G2
3  E4  F3  G3

`Reindexing`

In [403]:
pd.concat([df1,df4],axis= 1).reindex(df1.index)

    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E0  F0  G0
1  A1  B1  C1  D1  E1  F1  G1
2  A2  B2  C2  D2  E2  F2  G2
3  A3  B3  C3  D3  E4  F3  G3

**`SQL Functioning in Pandas`**

In [404]:
pd.concat([df1,df4],axis= 1, join = 'outer')

    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E0  F0  G0
1  A1  B1  C1  D1  E1  F1  G1
2  A2  B2  C2  D2  E2  F2  G2
3  A3  B3  C3  D3  E4  F3  G3

In [405]:
pd.concat([df1,df4],axis= 1, join = 'outer').reindex(df1.index)

    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E0  F0  G0
1  A1  B1  C1  D1  E1  F1  G1
2  A2  B2  C2  D2  E2  F2  G2
3  A3  B3  C3  D3  E4  F3  G3

In [406]:
pd.concat([df1,df4],axis= 1, join = 'inner')

    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E0  F0  G0
1  A1  B1  C1  D1  E1  F1  G1
2  A2  B2  C2  D2  E2  F2  G2
3  A3  B3  C3  D3  E4  F3  G3

In [407]:
pd.concat([df1,df4],axis= 1, join = 'inner').reindex(df1.index)

    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E0  F0  G0
1  A1  B1  C1  D1  E1  F1  G1
2  A2  B2  C2  D2  E2  F2  G2
3  A3  B3  C3  D3  E4  F3  G3

***************************************************************************************************************************

## `Append`

In [408]:
df1.append([df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   A5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

`ingoring`

In [409]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [410]:
df4

    E   F   G
0  E0  F0  G0
1  E1  F1  G1
2  E2  F2  G2
3  E4  F3  G3

In [411]:
pd.concat([df1,df4],ignore_index= True)

     A    B    C    D    E    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   E0   F0   G0
5  NaN  NaN  NaN  NaN   E1   F1   G1
6  NaN  NaN  NaN  NaN   E2   F2   G2
7  NaN  NaN  NaN  NaN   E4   F3   G3

In [412]:
pd.concat([df1,df4],ignore_index=False)

     A    B    C    D    E    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   E0   F0   G0
1  NaN  NaN  NaN  NaN   E1   F1   G1
2  NaN  NaN  NaN  NaN   E2   F2   G2
3  NaN  NaN  NaN  NaN   E4   F3   G3

*************************************************************************************************************************

### Merge

In [413]:
left = pd.DataFrame(
 {
     "key1":["K0","K0","K1","K2"],
     "Key2":["K0","K1","K0","K1"],
     "A":["A0","A1","A2","A3"],
     "B":["B0","B1","B2","B3"],
     
 })

In [414]:
left

  key1 Key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [415]:
right = pd.DataFrame(
 {
     "key1":["K0","K1","K1","K2"],
     "Key2":["K0","K0","K0","K0"],
     "C":["C0","C1","C2","C3"],
     "D":["D0","D1","D2","D3"]
     
 })

In [416]:
right

  key1 Key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [417]:
pd.merge(left,right, how= "left", on=["key1","Key2"])

  key1 Key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

****************************************************************************************************************************

### GrouBy

In [418]:
df5 = pd.DataFrame({"X":["B","B","A","A"],"Y":[1,2,3,4]})
df5

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [419]:
df5.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [420]:
import numpy as np

In [421]:
df6 = pd.DataFrame(

  {  "E":["foo","bar","foo","bar","foo","bar","foo","foo"],
    "F":["one","one","two","three","two","two","one","three"],
    "C":np.random.randn(8),
    "D":np.random.randn(8)
  }
)

In [422]:
df6

     E      F         C         D
0  foo    one  0.585606  0.763143
1  bar    one  0.545175 -1.928155
2  foo    two -1.280244  0.188928
3  bar  three -0.341130  0.809275
4  foo    two  2.172990  0.858093
5  bar    two  0.386690 -0.883286
6  foo    one -0.767190 -1.699294
7  foo  three  0.019266  0.631964

In [423]:
grouped = df6.groupby(["E","F"])

In [424]:
grouped = df6.groupby(["E","F"]).sum()
grouped

                  C         D
E   F
bar one    0.545175 -1.928155
    three -0.341130  0.809275
    two    0.386690 -0.883286
foo one   -0.181584 -0.936151
    three  0.019266  0.631964
    two    0.892746  1.047021

In [425]:
grouped

                  C         D
E   F
bar one    0.545175 -1.928155
    three -0.341130  0.809275
    two    0.386690 -0.883286
foo one   -0.181584 -0.936151
    three  0.019266  0.631964
    two    0.892746  1.047021

`sum, min, median`

In [426]:
grouped.sum()

C    1.321164
D   -1.259332
dtype: float64

In [427]:
grouped.min()

C   -0.341130
D   -1.928155
dtype: float64

In [428]:
grouped.median()

C    0.202978
D   -0.125661
dtype: float64

*******************************************************************************************************

### Missing data

In [429]:
df7 = pd.DataFrame(
    np.random.randn(5,3),
    index=["a","c","e","f","h"],
    columns = ["one","two","three"]
  )

In [430]:
df7

        one       two     three
a  1.309568  0.495794 -0.120338
c -0.734486 -0.061869 -1.098531
e -0.392374 -2.222488 -1.657010
f -2.128816 -0.458816  0.628435
h  0.073332 -0.333153  1.206839

**`Adding New Columns`**

In [431]:
df7["four"] = "bar"

In [432]:
df7

        one       two     three four
a  1.309568  0.495794 -0.120338  bar
c -0.734486 -0.061869 -1.098531  bar
e -0.392374 -2.222488 -1.657010  bar
f -2.128816 -0.458816  0.628435  bar
h  0.073332 -0.333153  1.206839  bar

In [433]:
df7.describe()

            one       two     three
count  5.000000  5.000000  5.000000
mean  -0.374555 -0.516106 -0.208121
std    1.249417  1.022102  1.183401
min   -2.128816 -2.222488 -1.657010
25%   -0.734486 -0.458816 -1.098531
50%   -0.392374 -0.333153 -0.120338
75%    0.073332 -0.061869  0.628435
max    1.309568  0.495794  1.206839

In [434]:
df7["five"]=df7["one"]>1
df7

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [437]:
df7["one"]

a    1.309568
c   -0.734486
e   -0.392374
f   -2.128816
h    0.073332
Name: one, dtype: float64

In [438]:
df7["one"].reindex(df7["one"])

one
 1.309568   NaN
-0.734486   NaN
-0.392374   NaN
-2.128816   NaN
 0.073332   NaN
Name: one, dtype: float64

`isna`

In [439]:
pd.isna(df7["one"])

a    False
c    False
e    False
f    False
h    False
Name: one, dtype: bool

`notna`

In [440]:
df7["one"].notna()

a    True
c    True
e    True
f    True
h    True
Name: one, dtype: bool

`fillna`
* filling the missing value

In [441]:
df7.fillna(0)

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [442]:
df7.fillna("missing")

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [443]:
df7["one"].fillna("missing")

a    1.309568
c   -0.734486
e   -0.392374
f   -2.128816
h    0.073332
Name: one, dtype: float64

`dropna`
>**Removing the null raws**

In [444]:
df7.dropna(axis=0) # drop all row which have nan values present over there

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [445]:
df7.dropna(axis=1) # drop all column which have nan values present over there

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [446]:
df7.dropna(how='any')

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [447]:
df7.dropna(axis =1,how='any')

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [448]:
df7.dropna(how='all')

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [449]:
df7.dropna(axis= 1,thresh= 1) # we want minium not null( not missing value) "one missing value"

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

In [450]:
df7.dropna(subset=['four'])

        one       two     three four   five
a  1.309568  0.495794 -0.120338  bar   True
c -0.734486 -0.061869 -1.098531  bar  False
e -0.392374 -2.222488 -1.657010  bar  False
f -2.128816 -0.458816  0.628435  bar  False
h  0.073332 -0.333153  1.206839  bar  False

***************************************************************************************************************************

### csv files

In [485]:
#Step1 : Get data and Study the data
# Categorial
# Continous
data2 = pd.read_csv('student_records.csv')
data2

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [486]:
# Step 2 : shape
data2.shape

(8, 6)

`Head`

In [487]:
#Step 3: Check first 5 rows
data2.head() # 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [488]:
data2.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

`tail`

In [489]:
data2.tail()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [490]:
data2.tail(2)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

`List of cloumns`

In [491]:
data2.columns # All cols

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [492]:
list(data2.columns)

['Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

`describe`

In [494]:
data2.describe() # Check Information

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [495]:
data2.min()

Name             David
OverallGrade         A
Obedient             N
ResearchScore       10
ProjectScore        17
Recommend           No
dtype: object

In [496]:
data2.median()

ResearchScore    75.0
ProjectScore     55.0
dtype: float64

**`Numerical Column`**

In [497]:
data2['ResearchScore'].quantile(0.5)

75.0

In [498]:
data2['ResearchScore'].quantile(0.9)

90.6

In [499]:
data2['ResearchScore'].mean()

63.375

In [500]:
data2['ResearchScore'].count()

8

In [501]:
x = data2.drop('Name',axis=1)
x

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

**`Categorical cols`**

In [502]:
list(set(x.columns) - set(x.describe().columns))

['Obedient', 'OverallGrade', 'Recommend']

In [504]:
x[cat_col]

  Obedient OverallGrade Recommend
0        Y            A       Yes
1        N            C       Yes
2        N            F        No
3        Y            B        No
4        N            E        No
5        Y            A       Yes
6        Y            B        No
7        Y            C        No

In [505]:
col_num = df.describe().columns
x = df[col_num]
x

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [506]:
x

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [507]:
x.sum()

Population    110200704
dtype: int64

In [508]:
x.sum(axis=0)

Population    110200704
dtype: int64

In [509]:
x.sum(axis=1)

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [510]:
x.mean(axis=0)

Population    22040140.8
dtype: float64

In [511]:
x.mean(axis=1)

California    38956785.0
Texas         26441568.0
New York      19555647.0
Florida       12364569.0
Illinois      12882135.0
dtype: float64

In [512]:
x.count(axis=0)

Population    5
dtype: int64

In [513]:
x.count(axis=1)

California    1
Texas         1
New York      1
Florida       1
Illinois      1
dtype: int64

**`Find the students who have got the research score >=80 with Name`**

In [514]:
data2.where(data2.ResearchScore >= 80)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y           90.0          85.0       Yes
1   John            C        N           85.0          51.0       Yes
2    NaN          NaN      NaN            NaN           NaN       NaN
3    NaN          NaN      NaN            NaN           NaN       NaN
4    NaN          NaN      NaN            NaN           NaN       NaN
5  Simon            A        Y           92.0          79.0       Yes
6    NaN          NaN      NaN            NaN           NaN       NaN
7    NaN          NaN      NaN            NaN           NaN       NaN

In [515]:
data2['ResearchScore'].sum()

507

In [516]:
data2[data2['ResearchScore'] >=80]

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
5  Simon            A        Y             92            79       Yes

In [517]:
data2[data2['ResearchScore'] >=80]['Name']

0    Henry
1     John
5    Simon
Name: Name, dtype: object

In [518]:
data2[data2['ResearchScore'] >=80]['Name'].shape[0]

3

In [519]:
data2[data2['ResearchScore'] >=80]['Name'].shape[0]+47

50

In [520]:
data2['OverallGrade'].unique()

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [521]:
data2['OverallGrade'].value_counts()

B    2
A    2
C    2
F    1
E    1
Name: OverallGrade, dtype: int64

In [526]:
data2['TOTAL'] = data2['ResearchScore'] + data2['ProjectScore']
data2

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend  TOTAL
0   Henry            A        Y             90            85       Yes    175
1    John            C        N             85            51       Yes    136
2   David            F        N             10            17        No     27
3  Holmes            B        Y             75            71        No    146
4  Marvin            E        N             20            30        No     50
5   Simon            A        Y             92            79       Yes    171
6  Robert            B        Y             60            59        No    119
7   Trent            C        Y             75            33        No    108

`Add Timepass column`

In [528]:
data2['TIMEPASS'] = 9999
data2

,Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,TOTAL,TIMEPASS
0,Henry,A,Y,90,85,Yes,175,9999
1,John,C,N,85,51,Yes,136,9999
2,David,F,N,10,17,No,27,9999
3,Holmes,B,Y,75,71,No,146,9999
4,Marvin,E,N,20,30,No,50,9999
5,Simon,A,Y,92,79,Yes,171,9999
6,Robert,B,Y,60,59,No,119,9999
7,Trent,C,Y,75,33,No,108,9999

In [529]:
nparray = data2.values
print(nparray)
print(type(nparray))
print(nparray.shape)

[['Henry' 'A' 'Y' 90 85 'Yes' 175 9999]
 ['John' 'C' 'N' 85 51 'Yes' 136 9999]
 ['David' 'F' 'N' 10 17 'No' 27 9999]
 ['Holmes' 'B' 'Y' 75 71 'No' 146 9999]
 ['Marvin' 'E' 'N' 20 30 'No' 50 9999]
 ['Simon' 'A' 'Y' 92 79 'Yes' 171 9999]
 ['Robert' 'B' 'Y' 60 59 'No' 119 9999]
 ['Trent' 'C' 'Y' 75 33 'No' 108 9999]]
<class 'numpy.ndarray'>
(8, 8)

****************************************************************************************************************************

`Databases`
--
**import cx_Oracle**

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxxx' # password for the database server

conn = cxOracle.connect( server=server, user=user, password=password )

query = 'select * from some_table'

df = pd.read_sql( query , conn )

`Happy Learning`
--